app/views/recipes/_form.html.erb

    <%= form.label :ingredient1 %>
    <%= form.select :ingredient1_id, options_for_select(Ingredient.all.map{|s|[s.name, s.id]}), id: :recipe_ingredient_id %>
---
SELECT "ingredients".* FROM "ingredients"