app/views/pizzas/_form.html.erb

    <%= form.label :recipe %>
    <%= form.select :recipe_id, options_for_select(Recipe.all.map{|s|[s.title, s.id]}), id: :pizza_recipe_id %>
---
SELECT "recipes".* FROM "recipes"

    <%= form.label :crust %>
    <%= form.select :crust_id, options_for_select(Crust.all.map{|s|[s.name, s.id]}), id: :pizza_crust_id %>
---
SELECT "crusts".* FROM "crusts"