app/views/pizzas/index.html.erb

        <td><%= pizza.crust.name %></td>
        <td><%= pizza.crust.value + pizza.recipe.value %></td>
---
SELECT  "crusts".* FROM "crusts" WHERE "crusts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."pizza_id" = ? LIMIT ?  [["pizza_id", 3], ["LIMIT", 1]]