app/views/pizzas/show.html.erb

SELECT  "crusts".* FROM "crusts" WHERE "crusts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Pizza value:</strong>
  <%= @pizza.recipe.value + @pizza.crust.value  %>