app/views/orders/_form.html.erb

    <%= form.label :pizza_id %>
    <%= form.select :pizza_id, options_for_select(Pizza.all.map{|s|[s.name, s.id]}), id: :order_pizza_id %>
---
SELECT "pizzas".* FROM "pizzas"

    <%= form.label :info_id %>
    <%= form.select :info_id, options_for_select(Info.all.map{|s|[s.name + " " + s.last_name + " - " + s.address, s.id]}), id: :order_info_id %>
---
SELECT "infos".* FROM "infos"