app/views/orders/index.html.erb

SELECT  "crusts".* FROM "crusts" WHERE "crusts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= order.info.address %></td>
	<td><%= order.pizza.crust.value + order.pizza.recipe.value %></td>