app/views/orders/show.html.erb

 <br>
 <%= "Value:" %> <%=@order.pizza.crust.value + @order.pizza.recipe.value %>
---
SELECT  "crusts".* FROM "crusts" WHERE "crusts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]