app/controllers/crusts_controller.rb

  def index
    @crusts = Crust.all
---
SELECT "crusts".* FROM "crusts"

  def create
    @crust = Crust.new(crust_params)

    respond_to do |format|
      if @crust.save
---
INSERT INTO "crusts" ("name", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Name"], ["value", 50], ["created_at", "2018-06-20 22:00:19.622933"], ["updated_at", "2018-06-20 22:00:19.622933"]]

  def destroy
    @crust.destroy
---
DELETE FROM "crusts" WHERE "crusts"."id" = ?  [["id", 1]]

    def set_crust
      @crust = Crust.find(params[:id])
---
SELECT  "crusts".* FROM "crusts" WHERE "crusts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]