app/controllers/infos_controller.rb

SELECT "infos".* FROM "infos"
---
  def index
    @infos = Info.all

INSERT INTO "infos" ("name", "last_name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Tomas"], ["last_name", "Silva"], ["address", "Juan Pablo 2"], ["phone", 89999011], ["created_at", "2018-06-20 22:53:02.790869"], ["updated_at", "2018-06-20 22:53:02.790869"]]
---
  def create
    @info = Info.new(info_params)

    respond_to do |format|
      if @info.save

SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_info
      @info = Info.find(params[:id])