app/controllers/ingredients_controller.rb

  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Pepperoni"], ["created_at", "2018-06-20 22:12:20.028028"], ["updated_at", "2018-06-20 22:12:20.028028"]]