app/controllers/orders_controller.rb

INSERT INTO "orders" ("pizza_id", "info_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pizza_id", 1], ["info_id", 1], ["created_at", "2018-06-20 23:12:57.648441"], ["updated_at", "2018-06-20 23:12:57.648441"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save