app/controllers/pizzas_controller.rb

INSERT INTO "pizzas" ("name", "description", "created_at", "updated_at", "recipe_id", "crust_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pizza 1"], ["description", "Description of pizza 1"], ["created_at", "2018-06-20 22:06:05.441507"], ["updated_at", "2018-06-20 22:06:05.441507"], ["recipe_id", 1], ["crust_id", 4]]
---
  def create
    @pizza = Pizza.new(pizza_params)

    respond_to do |format|
      if @pizza.save

DELETE FROM "pizzas" WHERE "pizzas"."id" = ?  [["id", 2]]
---
  def destroy
    @pizza.destroy

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_pizza
      @pizza = Pizza.find(params[:id])