app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "value", "created_at", "updated_at", "ingredient1_id", "ingredient2_id", "ingredient3_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "ingredient2_id" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["ingredient2_id", 3], ["updated_at", "2018-06-20 21:03:48.725053"], ["id", 2]]